<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Before-your-start:" data-toc-modified-id="Before-your-start:-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Before your start:</a></span></li><li><span><a href="#Challenge-1---Working-with-JSON-files" data-toc-modified-id="Challenge-1---Working-with-JSON-files-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Challenge 1 - Working with JSON files</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#After-importing-pandas,-let's-find-a-dataset.-In-this-lesson-we-will-be-working-with-a-NASA-dataset." data-toc-modified-id="After-importing-pandas,-let's-find-a-dataset.-In-this-lesson-we-will-be-working-with-a-NASA-dataset.-2.0.0.1"><span class="toc-item-num">2.0.0.1&nbsp;&nbsp;</span>After importing pandas, let's find a dataset. In this lesson we will be working with a NASA dataset.</a></span></li><li><span><a href="#The-value_counts()-function-is-commonly-used-in-pandas-to-find-the-frequency-of-every-value-in-a-column." data-toc-modified-id="The-value_counts()-function-is-commonly-used-in-pandas-to-find-the-frequency-of-every-value-in-a-column.-2.0.0.2"><span class="toc-item-num">2.0.0.2&nbsp;&nbsp;</span>The <code>value_counts()</code> function is commonly used in pandas to find the frequency of every value in a column.</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-2---Working-with-CSV-and-Other-Separated-Files" data-toc-modified-id="Challenge-2---Working-with-CSV-and-Other-Separated-Files-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Challenge 2 - Working with CSV and Other Separated Files</a></span></li><li><span><a href="#Challenge-3---Working-with-Excel-Files" data-toc-modified-id="Challenge-3---Working-with-Excel-Files-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Challenge 3 - Working with Excel Files</a></span></li><li><span><a href="#Bonus-Challenge---Fertility-Dataset" data-toc-modified-id="Bonus-Challenge---Fertility-Dataset-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Bonus Challenge - Fertility Dataset</a></span></li></ul></div>

# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Working with JSON files

Import the pandas library

In [1]:
# Your import here:
import pandas as pd

####  After importing pandas, let's find a dataset. In this lesson we will be working with a NASA dataset.

Run the code in the cell below to load the dataset containing information about asteroids that have landed on earth. This piece of code helps us open the URL for the dataset and deocde the data using UTF-8.

In [2]:
# Run this code

from urllib.request import urlopen
import json
# Con la librería request cargo los datos de una url 
response = urlopen("https://data.nasa.gov/resource/y77d-th95.json")
json_data = response.read().decode('utf-8', 'replace')

In the next cell, load the data in `json_data` and load it into a pandas dataframe. Name the dataframe `nasa`.

In [3]:
# Para trabajar con jsons, tengo que convertir el data en json si viene en un formato sucio
info = json.loads(json_data)

In [4]:
nasa = pd.json_normalize(info)

In [5]:
# Se puede obtener la ruta completa con pwd en bash desde la carpeta donde se encuentre el archivo

In [6]:
# /home/paula/Labs/2.2-lab-import-export/your-code

In [7]:
nasa = pd.read_json('nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [8]:
nasa.head(1)

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.775,6.08333,1880-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [9]:
nasa.value_counts('fall')

fall
Fell     996
Found      4
dtype: int64

In [10]:
type(nasa)

pandas.core.frame.DataFrame

Finally, let's save the dataframe as a json file again. Since we downloaded the file from an online source, the goal of saving the dataframe is to have a local copy. Save the dataframe using the `orient=records` argument and name the file `nasa.json`.

In [11]:
nasa.to_json('./nasa.json')

In [12]:
nasa = pd.read_json(orient='records', path_or_buf='./nasa.json')

In [13]:
#nasa.head(1)

# Challenge 2 - Working with CSV and Other Separated Files

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [14]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class', '']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [15]:
shuttle = pd.read_csv(tst_url, names=cols, sep=' ')

Let's verify that this worked by looking at the `head()` function.

In [16]:
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class,
0,55,0,81,0,-6,11,25,88,64,4
1,56,0,96,0,52,-4,40,44,4,4
2,50,-1,89,-7,50,0,39,40,2,1
3,53,9,79,0,42,-2,25,37,12,4
4,55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [17]:
shuttle.to_csv('./shuttle.csv')

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

Use the `head()` function to inspect the dataframe.

In [18]:
# xlrd library está instalada
astronaut = pd.read_excel('astronauts.xls')
astronaut.head(1)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [24]:
astronaut.value_counts('Undergraduate Major')

Undergraduate Major
Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Marine Engineering & Nautical Science     1
Mathematical & Electrical Science         1
Biochemistry                              1
Mathematics & Economics                   1
Accounting                                1
Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [26]:
astronaut.to_csv('./astronaut.csv')

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [38]:
#Me han echado un cable para este lab, menos mal que no ha sido al cuello (pero casi).

In [35]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt' 
fertility = pd.read_csv(url, sep=',')

In [36]:
fertility

    -0.33  0.69  0  1  1.1  0.1  0.8  0.2  0.88  N
0   -0.33  0.94  1  0    1    0  0.8    1  0.31  O
1   -0.33  0.50  1  0    0    0  1.0   -1  0.50  N
2   -0.33  0.75  0  1    1    0  1.0   -1  0.38  N
3   -0.33  0.67  1  1    0    0  0.8   -1  0.50  O
4   -0.33  0.67  1  0    1    0  0.8    0  0.50  N
..    ...   ... .. ..  ...  ...  ...  ...   ... ..
94  -1.00  0.67  1  0    0    0  1.0   -1  0.50  N
95  -1.00  0.61  1  0    0    0  0.8    0  0.50  N
96  -1.00  0.67  1  1    1    0  1.0   -1  0.31  N
97  -1.00  0.64  1  0    1    0  1.0    0  0.19  N
98  -1.00  0.69  0  1    1    0  0.6   -1  0.19  N

[99 rows x 10 columns]